; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite5 - satellite
	instrument6 - instrument
	satellite6 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite7 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite8 - satellite
	instrument12 - instrument
	spectrograph1 - mode
	image0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 image0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite4)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument6 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
	(supports instrument7 image0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite6)
	(on_board instrument8 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation4)
	(supports instrument9 image0)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 image0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 spectrograph1)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation4)
	(on_board instrument9 satellite7)
	(on_board instrument10 satellite7)
	(on_board instrument11 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star8)
	(supports instrument12 spectrograph1)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument12 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Planet6)
	(pointing satellite4 Phenomenon10)
	(pointing satellite7 Star0)
	(have_image Star5 image0)
	(have_image Planet6 spectrograph1)
	(have_image Star7 spectrograph1)
	(have_image Star8 image0)
	(have_image Star9 image0)
	(have_image Phenomenon10 spectrograph1)
))

)

; plan
1. (turn_to satellite7 star0 star8)
   deleted: (pointing satellite7 star8)
   added: (pointing satellite7 star0)
   goals met: 1 of 9
2. (switch_on instrument5 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 1 of 9
3. (calibrate satellite4 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 1 of 9
4. (turn_to satellite4 star7 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 star7)
   goals met: 1 of 9
5. (take_image satellite4 star7 instrument5 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 2 of 9
6. (turn_to satellite4 star5 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star5)
   goals met: 2 of 9
7. (take_image satellite4 star5 instrument5 image0)
   added: (have_image star5 image0)
   goals met: 3 of 9
8. (turn_to satellite4 planet6 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 planet6)
   goals met: 3 of 9
9. (turn_to satellite0 planet6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet6)
   goals met: 4 of 9
10. (take_image satellite4 planet6 instrument5 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 5 of 9
11. (turn_to satellite4 star8 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star8)
   goals met: 5 of 9
12. (take_image satellite4 star8 instrument5 image0)
   added: (have_image star8 image0)
   goals met: 6 of 9
13. (turn_to satellite4 star9 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 star9)
   goals met: 6 of 9
14. (take_image satellite4 star9 instrument5 image0)
   added: (have_image star9 image0)
   goals met: 7 of 9
15. (turn_to satellite4 phenomenon10 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 phenomenon10)
   goals met: 8 of 9
16. (take_image satellite4 phenomenon10 instrument5 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 9 of 9
